<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>PayloadContent</key>
		<array>
			<dict>
				<key>UserDefinedName</key>
				<string>Home VPN</string>
				<key>PayloadDisplayName</key>
				<string>Home VPN</string>
				<key>PayloadIdentifier</key>
				<string>be.egregius.home</string>
				<key>PayloadUUID</key>
				<string>85284094-A9F5-47D7-A1CD-6F831B2FFAC0</string>
				<key>VPNType</key>
				<string>IPSec</string>
				<key>IPSec</key>
				<dict>
					<key>RemoteAddress</key>
					<string>home.egregius.be</string>
					<key>AuthenticationMethod</key>
					<string>SharedSecret</string>
					<key>XAuthName</key>
					<string>Guy</string>
					<key>XAuthPassword</key>
					<string>homegrBE!8800</string>
					<key>XAuthEnabled</key>
					<integer>1</integer>
					<key>LocalIdentifier</key>
					<string>vpnusers@home.egregius.be</string>
					<key>LocalIdentifierType</key>
					<string>KeyID</string>
					<key>SharedSecret</key>
					<string>67f317d13a7f444ef7c5206129cbcb6dae97be2efb7f33dfb36338e7</string>
				</dict>
				<key>OnDemandEnabled</key>
				<integer>1</integer>
				<key>OnDemandRules</key>
				<array>
					<dict>
						<key>InterfaceTypeMatch</key>
						<string>WiFi</string>
						<key>SSIDMatch</key>
						<array>
							<string>Egregius</string>
						</array>
						<key>Action</key>
						<string>Disconnect</string>
					</dict>
					<dict>
						<!-- VPN Default state -->
						<key>Action</key>
						<string>Connect</string>
					</dict>
				</array>
				<key>OverridePrimary</key>
				<true/>
				<key>IPv4</key>
				<dict>
					<key>OverridePrimary</key>
					<integer>1</integer>
				</dict>
				<key>PayloadType</key>
				<string>com.apple.vpn.managed</string>
				<key>PayloadVersion</key>
				<integer>1</integer>
			</dict>
		</array>
		<key>PayloadDisplayName</key>
		<string>Home VPN</string>
		<key>PayloadIdentifier</key>
		<string>89751E9B-DC25-8AE9-DA98-18C4C85D3E2E</string>
		<key>PayloadRemovalDisallowed</key>
		<false/>
		<key>PayloadType</key>
		<string>Configuration</string>
		<key>PayloadUUID</key>
		<string>7FF45CEF-6A7C-BBC8-1584-E14C6267083D</string>
		<key>PayloadVersion</key>
		<integer>1</integer>
	</dict>
</plist>